#ifndef _STR_H
#define _STR_H

#include "Basedefine.h"


/*——————————————————————————
* 函 数 名：StrLen
* 输入参数：pStr:字符串指针
* 输出参数：None
* 返 回 值：字符串长度
* 功能说明：计算字符串长度
*——————————————————————————*/
u16 StrLen(char *pStr);

/*——————————————————————————
* 函 数 名：StrCmp
* 输入参数：pDsc:字符串目的地址    pSrc:字符串源地址
* 输出参数：None
* 返 回 值：TRUE-相同    FALSE-不同
* 功能说明：比较字符串内容
*——————————————————————————*/
bool StrCmp(char *pDsc, char *pSrc);

/*——————————————————————————
* 函 数 名：GetProStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取协议字符串
*——————————————————————————*/
const u8 * GetProStr(u8 val);

/*——————————————————————————
* 函 数 名：GetValidStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取有效字符串
*——————————————————————————*/
const u8 * GetValidStr(u8 val);

/*——————————————————————————
* 函 数 名：GetConfirmStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取确认字符串
*——————————————————————————*/
const u8 * GetConfirmStr(u8 val);

/*——————————————————————————
* 函 数 名：GetTypeStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取设备类型字符串
*——————————————————————————*/
const u8 * GetTypeStr(u8 val);

/*——————————————————————————
* 函 数 名：GetProTypeStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取协议类型字符串
*——————————————————————————*/
const u8 * GetProTypeStr(u8 val);

/*——————————————————————————
* 函 数 名：GetConfigStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取配置字符串
*——————————————————————————*/
const u8 * GetConfigStr(u8 val);

/*——————————————————————————
* 函 数 名：GetReadStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取抄读结果字符串
*——————————————————————————*/
const u8 * GetReadStr(u8 val);

/*——————————————————————————
* 函 数 名：GetStatusStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取路由状态字符串
*——————————————————————————*/
const u8 * GetStatusStr(u8 val);

/*——————————————————————————
* 函 数 名：GetModeStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取路由方式字符串
*——————————————————————————*/
const u8 * GetModeStr(u8 val);

/*——————————————————————————
* 函 数 名：GetBeaconModeStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取组网模式字符串
*——————————————————————————*/
const u8 * GetBeaconModeStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNIModeStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取收集模式字符串
*——————————————————————————*/
const u8 * GetNIModeStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNetStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取网络标识字符串
*——————————————————————————*/
const u8 * GetNetStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNwkAttrStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取网络层属性字符串
*——————————————————————————*/
const u8 * GetNwkAttrStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNwkStatusStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取网络层主状态字符串
*——————————————————————————*/
const u8 * GetNwkStatusStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNwkSubStaStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取网络层子状态字符串
*——————————————————————————*/
const u8 * GetNwkSubStaStr(u8 val);

/*——————————————————————————
* 函 数 名：GetNwkCmdStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取网络层命令字符串
*——————————————————————————*/
const u8 * GetNwkCmdStr(u8 val);

/*——————————————————————————
* 函 数 名：GetPhySpiStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取物理层SPI字符串
*——————————————————————————*/
const u8 * GetPhySpiStr(u8 val);

/*——————————————————————————
* 函 数 名：GetVssBlockStaStr
* 输入参数：val    传入值
* 输出参数：None
* 返 回 值：字符串
* 功能说明：获取VSS块状态字符串
*——————————————————————————*/
const u8 * GetVssBlockStaStr(u8 val);

#endif

